## Plan Result (pocket-event-bridge-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/98420)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelisteventsitems-rule-dlq-alarm_FE2F950E
* Delete
  * aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3 will be destroyed
  # (because aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3 is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "shareable-list-item-events_shareablelistevents-rule-dlq-alarm_2CE4E6A3" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical",
        ] -> null
      - alarm_description         = "Number of messages >= 10" -> null
      - alarm_name                = "PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm" -> null
      - arn                       = "arn:aws:cloudwatch:us-east-1:996905175585:alarm:PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {
          - "QueueName" = "PocketEventBridge-Prod-SNS-ShareableListEvents-Topic-DLQ"
        } -> null
      - evaluation_periods        = 4 -> null
      - id                        = "PocketEventBridge-Prod-ShareableListEvents-Rule-dlq-alarm" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "ApproximateNumberOfMessagesVisible" -> null
      - namespace                 = "AWS/SQS" -> null
      - ok_actions                = [
          - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical",
        ] -> null
      - period                    = 300 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "environment" = "Prod"
          - "service"     = "PocketEventBridge"
        } -> null
      - threshold                 = 10 -> null
      - treat_missing_data        = "missing" -> null
    }

  # aws_cloudwatch_metric_alarm.shareable-list-item-events_shareablelisteventsitems-rule-dlq-alarm_FE2F950E will be created
  + resource "aws_cloudwatch_metric_alarm" "shareable-list-item-events_shareablelisteventsitems-rule-dlq-alarm_FE2F950E" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical",
        ]
      + alarm_description                     = "Number of messages >= 10"
      + alarm_name                            = "PocketEventBridge-Prod-ShareableListEventsItems-Rule-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "PocketEventBridge-Prod-SNS-ShareableListItemEvents-Topic-DLQ"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 4
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-Infrastructure-Alarm-Non-Critical",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "environment" = "Prod"
          + "service"     = "PocketEventBridge"
        }
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"d45f01c3-626e-4672-b8ff-1d37378c0cb8","JobName":"pocket-event-bridge_infrastructure_plan_prod","PRNumber":331,"Program":"tfcmt","SHA1":"91abaa5e48b7c39f40f45b30565614e9c461edd2","Target":"pocket-event-bridge-cdk","Vars":{}} -->